Revit 2027 API
OrdinateDimensionSetting.DimensionLineLength Property
 Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DimensionLineLength { get; set; }
Public Property DimensionLineLength As Double
	Get
	Set
public:
property double DimensionLineLength {
	double get ();
	void set (double value);
}
member DimensionLineLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for dimensionLineLength must be greater than 0 and no more than 30000 feet.
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace